{
  "id": "petunia-atkinsiana",
  "scientificName": "Petunia x atkinsiana",
  "etymology": "The name 'Petunia' is derived from the Tupi-Guarani word 'petun' which means tobacco, as the two plants are closely related. The 'x' in the scientific name signifies that it is a hybrid of two or more species.",
  "history": "Petunia x atkinsiana is a complex hybrid derived from several wild South American petunia species. Bred for its prolific flowering, vibrant colors, and large blooms, it has become one of the most popular annual bedding plants and container flowers in gardens and on patios worldwide.",
  "commonNames": [
    "Petunia"
  ],
  "image": "images/petunia/petunia1.jpg",
  "gallery": [
    "images/petunia/petunia1.jpg",
    "images/petunia/petunia2.jpg",
    "images/petunia/petunia3.jpg"
  ],
  "care": {
    "description": "A sun-loving plant that requires consistent watering and regular deadheading to keep flowering.",
    "tips": [
      "Regularly deadhead spent blooms to encourage more flowers.",
      "Provide a support for vining varieties or let them spill from a pot."
    ],
    "issues": [
      "<strong>Yellowing leaves:</strong> Can be a sign of overwatering or a lack of nutrients. Check soil moisture and consider fertilizing.",
      "<strong>Leggy growth:</strong> Indicates not enough light. Move to a sunnier location.",
      "<strong>Failure to bloom:</strong> Usually due to a lack of sun, nutrients, or insufficient deadheading."
    ],
    "detail": "Petunias are a classic choice for vibrant, colorful displays. They are annuals, meaning they complete their life cycle in one year. They require at least 6-8 hours of direct sun per day to produce a full flush of flowers. Petunias are heavy feeders and will benefit from regular fertilization. Consistent watering is essential, as they do not like to dry out completely. To keep them looking their best, you must 'deadhead' spent flowers by pinching them off at the base. This encourages the plant to produce more blooms and prevents it from setting seed.",
    "howToImages": [
      {
        "path": "images/petunia/care1.jpg",
        "caption": "Petunias thriving in a full-sun container."
      },
      {
        "path": "images/petunia/care2.jpg",
        "caption": "Deadheading a spent bloom to encourage new growth."
      }
    ]
  },
  "watering": {
    "description": "Requires consistent watering, especially in hot weather.",
    "tips": [
      "Check soil moisture daily in hot, sunny weather.",
      "Water at the base of the plant to avoid getting leaves wet."
    ],
    "issues": [
      "Overwatering can cause root rot and yellowing leaves. Underwatering will cause the plant to wilt and droop."
    ],
    "detail": "Petunias do not like to dry out. In hot summer weather, they may need to be watered daily. It is best to water them deeply and consistently. Ensure the soil is moist but not soggy. A pot with good drainage is essential. A great sign of thirst is when the plant begins to droop, but it will quickly perk up after a good watering.",
    "frequency": "Daily in summer, otherwise every 2-3 days",
    "howToImages": [
      {
        "path": "images/petunia/watering1.jpg",
        "caption": "Checking for dryness in hot weather."
      },
      {
        "path": "images/petunia/watering2.jpg",
        "caption": "Watering deeply and consistently at the soil level."
      }
    ]
  },
  "light": {
    "description": "Requires at least 6 hours of full sun per day.",
    "idealHours": "6-8 hours",
    "detail": "Petunias are sun-loving plants that need plenty of direct sunlight to thrive. A location with full sun for at least 6 hours a day is essential for a good show of blooms. If they do not receive enough sun, the stems will become long and leggy, and they will produce very few flowers.",
    "howToImages": [
      {
        "path": "images/petunia/light1.jpg",
        "caption": "Petunias placed in a sunny, exposed garden bed."
      },
      {
        "path": "images/petunia/light2.jpg",
        "caption": "Example of leggy growth due to insufficient light."
      }
    ],
    "tips": [
      "Plant in your sunniest spot.",
      "If growing in a container, ensure it can be moved to a sunny location."
    ]
  },
  "medium": {
    "description": "A well-draining, rich potting mix is best.",
    "detail": "Use a high-quality potting mix that is rich in organic matter and has good drainage. A standard potting mix is usually sufficient. Since petunias are heavy feeders, a mix that contains some slow-release fertilizer can be beneficial. Avoid heavy clay soils that retain too much moisture.",
    "howToImages": [
      {
        "path": "images/petunia/medium1.jpg",
        "caption": "Using a rich, high-quality potting mix."
      },
      {
        "path": "images/petunia/medium2.jpg",
        "caption": "Amending soil with slow-release fertilizer."
      }
    ],
    "tips": [
      "Add compost or manure to the soil for extra nutrients.",
      "Plant in containers with plenty of drainage holes."
    ]
  },
  "propagation": {
    "description": "Can be grown from seeds or propagated from stem cuttings.",
    "detail": "Petunias can be propagated from stem cuttings, which is a great way to save a favorite variety for the next season. Take a cutting from a healthy stem, remove the lower leaves, and plant it in moist soil. Keep the cutting in a humid environment and away from direct sunlight until it has rooted. For most gardeners, growing petunias from seeds is the more common method.",
    "tips": [
      "Take cuttings from non-flowering stems.",
      "Rooting hormone can help increase the success rate."
    ],
    "howToImages": [
      {
        "path": "images/petunia/cutting.jpg",
        "caption": "Preparing a stem cutting for planting."
      },
      {
        "path": "images/petunia/seed.jpg",
        "caption": "Planting petunia seeds for germination."
      }
    ]
  },
  "issues": {
    "description": "Common issues include leggy growth from lack of sun and yellowing leaves from overwatering.",
    "image": [
      "images/petunia/drooping.jpg",
      "images/petunia/yellow.jpg"
    ],
    "tips": [
      "If the plant looks sad, check for proper watering and sun exposure."
    ]
  },
  "toxicity": {
    "description": "Non-toxic and safe for pets and children."
  },
  "tags": [
    "annual",
    "flowering",
    "full-sun",
    "garden-plant",
    "container-plant",
    "heavy-feeder"
  ]
}